## Plan Result (prod-prod)




<pre><code>Plan: 78 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;ftp&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_2839A4D7B35DEA51C78058F9261F6878.px01.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_2839A4D7B35DEA51C78058F9261F6878.px02.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_2839A4D7B35DEA51C78058F9261F6878.px03.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_2839A4D7B35DEA51C78058F9261F6878.sip.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_CFFC0F58728FFEB1AEC569F22929D62C.px01.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_CFFC0F58728FFEB1AEC569F22929D62C.px02.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_CFFC0F58728FFEB1AEC569F22929D62C.px03.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_CFFC0F58728FFEB1AEC569F22929D62C.sip.preprod.self-test&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;atcmdemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;c2idemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;c2ishowandtell&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;ccr-prototype&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;ccrdemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;confluence-nle&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;cp.cjs&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;crowd-nle&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;dev.cpp&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;devcp2.cpp&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;i2tdemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;jira-nle&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;pp.confluence&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;pp.crowd&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;pp.hipchat&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;pp.jira&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;preprod-bastion&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;prod-bastion&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;r2showandtell&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;redact.c2idemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;redact.dev.cpp&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.divorce-backoffice.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.divorce.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.probate-two.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.probate.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.sscs.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;test-reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;tools&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;*.dev.cpp&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;*.dev2.cpp&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;_domainconnect&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;autodiscover&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;email&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;enterpriseenrollment&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;enterpriseregistration&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;ftp&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;lyncdiscover&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;msoid&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;notices&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;selector1._domainkey&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;selector2._domainkey&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;sip&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;tools.oldprd&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;www.notices&#34;]
  * module.hmcts_net.azurerm_dns_mx_record.this[&#34;@&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;apps&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;apps-nle&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;az&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;ctsc&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;hearings&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;internal&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;lab&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;mft&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;platform&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;reform&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;sftp&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;ukc&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;vh&#34;]
  * module.hmcts_net.azurerm_dns_srv_record.this[&#34;_sip._tls&#34;]
  * module.hmcts_net.azurerm_dns_srv_record.this[&#34;_sipfederationtls._tcp&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;@&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;_asvdns-c088fba7-73a7-472a-badb-d3009e6de955&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;_dmarc&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;_github-challenge-hmcts&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;cp.cjs&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;mailrelay.platform&#34;]
  * module.hmcts_net.azurerm_dns_zone.zone
  * module.hmcts_net.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cjscp_org_uk.azurerm_dns_cname_record.this["ftp"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ftp"
      + record              = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.hearings.azurerm_dns_cname_record.this["_2839A4D7B35DEA51C78058F9261F6878.px01.dev.self-test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_2839a4d7b35dea51c78058f9261f6878.px01.dev.self-test"
      + record              = "54A4FE36A0565C688435E68A102DC6AF.4AF70ABA62B14957F681867D5EC9D9AE.b3fa5d5ed7f0fcd535e6.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_2839A4D7B35DEA51C78058F9261F6878.px02.dev.self-test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_2839a4d7b35dea51c78058f9261f6878.px02.dev.self-test"
      + record              = "54A4FE36A0565C688435E68A102DC6AF.4AF70ABA62B14957F681867D5EC9D9AE.b3fa5d5ed7f0fcd535e6.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_2839A4D7B35DEA51C78058F9261F6878.px03.dev.self-test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_2839a4d7b35dea51c78058f9261f6878.px03.dev.self-test"
      + record              = "54A4FE36A0565C688435E68A102DC6AF.4AF70ABA62B14957F681867D5EC9D9AE.b3fa5d5ed7f0fcd535e6.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_2839A4D7B35DEA51C78058F9261F6878.sip.dev.self-test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_2839a4d7b35dea51c78058f9261f6878.sip.dev.self-test"
      + record              = "54A4FE36A0565C688435E68A102DC6AF.4AF70ABA62B14957F681867D5EC9D9AE.b3fa5d5ed7f0fcd535e6.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_CFFC0F58728FFEB1AEC569F22929D62C.px01.preprod.self-test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_cffc0f58728ffeb1aec569f22929d62c.px01.preprod.self-test"
      + record              = "3E61D2C283A5EEC4DDB95FC695903E9A.F1743509B80EFA3A153C613F20DA3B5A.38127b2fffc57add85d6.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_CFFC0F58728FFEB1AEC569F22929D62C.px02.preprod.self-test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_cffc0f58728ffeb1aec569f22929d62c.px02.preprod.self-test"
      + record              = "3E61D2C283A5EEC4DDB95FC695903E9A.F1743509B80EFA3A153C613F20DA3B5A.38127b2fffc57add85d6.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_CFFC0F58728FFEB1AEC569F22929D62C.px03.preprod.self-test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_cffc0f58728ffeb1aec569f22929d62c.px03.preprod.self-test"
      + record              = "3E61D2C283A5EEC4DDB95FC695903E9A.F1743509B80EFA3A153C613F20DA3B5A.38127b2fffc57add85d6.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_CFFC0F58728FFEB1AEC569F22929D62C.sip.preprod.self-test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_cffc0f58728ffeb1aec569f22929d62c.sip.preprod.self-test"
      + record              = "3E61D2C283A5EEC4DDB95FC695903E9A.F1743509B80EFA3A153C613F20DA3B5A.38127b2fffc57add85d6.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["atcmdemo"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "atcmdemo"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["c2idemo"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "c2idemo"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["c2ishowandtell"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "c2ishowandtell"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["ccr-prototype"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccr-prototype"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["ccrdemo"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccrdemo"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 43200
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["confluence-nle"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "confluence-nle"
      + records             = [
          + "51.145.22.226",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["cp.cjs"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cp.cjs"
      + records             = [
          + "40.67.248.37",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["crowd-nle"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "crowd-nle"
      + records             = [
          + "51.145.22.226",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["dev.cpp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dev.cpp"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["devcp2.cpp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "devcp2.cpp"
      + records             = [
          + "10.125.114.60",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["i2tdemo"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "i2tdemo"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["jira-nle"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "jira-nle"
      + records             = [
          + "51.145.22.226",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["pp.confluence"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pp.confluence"
      + records             = [
          + "51.179.201.14",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["pp.crowd"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pp.crowd"
      + records             = [
          + "51.179.201.14",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["pp.hipchat"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pp.hipchat"
      + records             = [
          + "51.179.201.14",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["pp.jira"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pp.jira"
      + records             = [
          + "51.179.201.14",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["preprod-bastion"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "preprod-bastion"
      + records             = [
          + "10.20.1.27",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["prod-bastion"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod-bastion"
      + records             = [
          + "10.20.1.12",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["r2showandtell"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "r2showandtell"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["redact.c2idemo"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "redact.c2idemo"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["redact.dev.cpp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "redact.dev.cpp"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["sandbox.divorce-backoffice.reform"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sandbox.divorce-backoffice.reform"
      + records             = [
          + "51.179.201.13",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["sandbox.divorce.reform"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sandbox.divorce.reform"
      + records             = [
          + "51.179.201.13",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["sandbox.probate-two.reform"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sandbox.probate-two.reform"
      + records             = [
          + "51.179.201.13",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["sandbox.probate.reform"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sandbox.probate.reform"
      + records             = [
          + "51.179.201.13",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["sandbox.sscs.reform"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sandbox.sscs.reform"
      + records             = [
          + "51.179.201.13",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["test-reform"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "test-reform"
      + records             = [
          + "83.151.216.178",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_a_record.this["tools"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tools"
      + records             = [
          + "51.104.17.168",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["*.dev.cpp"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*.dev.cpp"
      + record              = "dev.cpp.hmcts.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["*.dev2.cpp"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*.dev2.cpp"
      + record              = "*dev.cpp."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["_domainconnect"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_domainconnect"
      + record              = "_domainconnect.gd.domaincontrol.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["autodiscover"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "autodiscover"
      + record              = "autodiscover.outlook.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["email"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "email"
      + record              = "email.secureserver.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["enterpriseenrollment"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "enterpriseenrollment"
      + record              = "enterpriseenrollment.manage.microsoft.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["enterpriseregistration"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "enterpriseregistration"
      + record              = "enterpriseregistration.windows.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["ftp"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ftp"
      + record              = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["lyncdiscover"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lyncdiscover"
      + record              = "webdir.online.lync.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["msoid"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "msoid"
      + record              = "clientconfig.microsoftonline-p.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["notices"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "notices"
      + record              = "www95.wixdns.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["selector1._domainkey"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "selector1._domainkey"
      + record              = "selector1-hmcts-net._domainkey.cjscommonplatform.onmicrosoft.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["selector2._domainkey"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "selector2._domainkey"
      + record              = "selector2-hmcts-net._domainkey.cjscommonplatform.onmicrosoft.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["sip"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sip"
      + record              = "sipdir.online.lync.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["tools.oldprd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tools.oldprd"
      + record              = "atlprod.northeurope.cloudapp.azure.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["www.notices"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.notices"
      + record              = "www95.wixdns.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_mx_record.this["@"] will be created
  + resource "azurerm_dns_mx_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + exchange   = "hmcts-net.mail.protection.outlook.com."
          + preference = "0"
        }
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["apps"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apps"
      + records             = [
          + "ns1-03.azure-dns.com.",
          + "ns2-03.azure-dns.net.",
          + "ns3-03.azure-dns.org.",
          + "ns4-03.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["apps-nle"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apps-nle"
      + records             = [
          + "ns1-01.azure-dns.com.",
          + "ns2-01.azure-dns.net.",
          + "ns3-01.azure-dns.org.",
          + "ns4-01.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["az"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "az"
      + records             = [
          + "ns2.he.net.",
          + "ns3.he.net.",
          + "ns4.he.net.",
          + "ns5.he.net.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["ctsc"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ctsc"
      + records             = [
          + "ns1-09.azure-dns.com.",
          + "ns2-09.azure-dns.net.",
          + "ns3-09.azure-dns.org.",
          + "ns4-09.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["hearings"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hearings"
      + records             = [
          + "ns1-07.azure-dns.com.",
          + "ns2-07.azure-dns.net.",
          + "ns3-07.azure-dns.org.",
          + "ns4-07.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["internal"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "internal"
      + records             = [
          + "ns1-02.azure-dns.com",
          + "ns2-02.azure-dns.net",
          + "ns3-02.azure-dns.org",
          + "ns4-02.azure-dns.info",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 900
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["lab"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lab"
      + records             = [
          + "ns1-02.azure-dns.com.",
          + "ns2-02.azure-dns.net.",
          + "ns3-02.azure-dns.org.",
          + "ns4-02.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["mft"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mft"
      + records             = [
          + "ns1-01.azure-dns.com.",
          + "ns2-01.azure-dns.net.",
          + "ns3-01.azure-dns.org.",
          + "ns4-01.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["platform"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "platform"
      + records             = [
          + "ns1-04.azure-dns.com.",
          + "ns2-04.azure-dns.net.",
          + "ns3-04.azure-dns.org.",
          + "ns4-04.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["reform"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reform"
      + records             = [
          + "ns1-09.azure-dns.com.",
          + "ns2-09.azure-dns.net.",
          + "ns3-09.azure-dns.org.",
          + "ns4-09.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["sftp"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sftp"
      + records             = [
          + "ns1-03.azure-dns.com.",
          + "ns2-03.azure-dns.net.",
          + "ns3-03.azure-dns.org.",
          + "ns4-03.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["ukc"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ukc"
      + records             = [
          + "ns2.he.net.",
          + "ns3.he.net.",
          + "ns4.he.net.",
          + "ns5.he.net.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["vh"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh"
      + records             = [
          + "ns1-01.azure-dns.com.",
          + "ns2-01.azure-dns.net.",
          + "ns3-01.azure-dns.org.",
          + "ns4-01.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_srv_record.this["_sip._tls"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_sip._tls"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + port     = 443
          + priority = 100
          + target   = "sipdir.online.lync.com."
          + weight   = 1
        }
    }

  # module.hmcts_net.azurerm_dns_srv_record.this["_sipfederationtls._tcp"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_sipfederationtls._tcp"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + port     = 5061
          + priority = 100
          + target   = "sipfed.online.lync.com."
          + weight   = 1
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["@"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 86400
      + zone_name           = "hmcts.net"

      + record {
          + value = "Dynatrace-site-verification=d47aef0a-5479-4cca-a55c-61e11aa2dfd2__h43u3tim5arpipfnpqj3l75aap"
        }
      + record {
          + value = "docker-verification=f8449b84-5631-4671-b7f0-e7f06acbdbf8"
        }
      + record {
          + value = "google-site-verification=4lnbRW6qCFRgeNOyGIONf-Z2xyieSnKiHMngA60wxpE"
        }
      + record {
          + value = "google-site-verification=TMU69wadrpW6V0YxpFfxuXST3nKEiMWWHA2KN88CwvI"
        }
      + record {
          + value = "v=spf1 include:spf.protection.outlook.com include:notifications.service.gov.uk include:mailrelay.platform.hmcts.net include:prod.mailrelay.platform.hmcts.net a:c.spf.service-now.com -all"
        }
      + record {
          + value = "v=verifydomain MS=6154796"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["_asvdns-c088fba7-73a7-472a-badb-d3009e6de955"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_asvdns-c088fba7-73a7-472a-badb-d3009e6de955"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "asvdns_34e5993c-ddc8-4eba-9d00-b9f6f77b97f2"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["_dmarc"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dmarc"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "v=DMARC1;p=reject;sp=reject;fo=1;rua=mailto:ems@hmcts.net,mailto:ZMrwN3whEje@dmarc-rua.mailcheck.service.ncsc.gov.uk;ruf=mailto:ems@hmcts.net"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["_github-challenge-hmcts"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_github-challenge-hmcts"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "2902f9735b"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["cp.cjs"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cp.cjs"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "MS=ms61478066"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["mailrelay.platform"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mailrelay.platform"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "MS=ms79803021"
        }
    }

  # module.hmcts_net.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"
    }

  # module.hmcts_net.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 78 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1150,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->